balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1503.PIC
        <edc:SFRDef edc:access="nrnn-nnn" edc:cname="CM2CON0" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-100" edc:name="CM2CON0" edc:nzwidth="0x8" edc:por="0000-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C2SYNC" edc:desc="" edc:mask="0x1" edc:name="C2SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS" edc:desc="" edc:mask="0x1" edc:name="C2HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2SP" edc:desc="" edc:mask="0x1" edc:name="C2SP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2POL" edc:desc="" edc:mask="0x1" edc:name="C2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OE" edc:desc="" edc:mask="0x1" edc:name="C2OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2ON" edc:desc="" edc:mask="0x1" edc:name="C2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="CM2CON1" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="CM2CON1" edc:nzwidth="0x8" edc:por="0000-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C2NCH" edc:desc="" edc:mask="0x7" edc:name="C2NCH" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH" edc:desc="" edc:mask="0x3" edc:name="C2PCH" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C2INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C2INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C2INTP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2NCH0" edc:desc="" edc:mask="0x1" edc:name="C2NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH1" edc:desc="" edc:mask="0x1" edc:name="C2NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH2" edc:desc="" edc:mask="0x1" edc:name="C2NCH2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH0" edc:desc="" edc:mask="0x1" edc:name="C2PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH1" edc:desc="" edc:mask="0x1" edc:name="C2PCH1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rr" edc:cname="CMOUT" edc:desc="Comparator Output Register" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CMOUT" edc:nzwidth="8" edc:por="------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MC1OUT" edc:desc="" edc:mask="0x1" edc:name="MC1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MC2OUT" edc:desc="" edc:mask="0x1" edc:name="MC2OUT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-----r" edc:cname="BORCON" edc:desc="Brown-out Reset Control Register" edc:impl="0xc1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-----u" edc:name="BORCON" edc:nzwidth="8" edc:por="10-----q">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BORRDY" edc:desc="Brown-out Reset Circuit Ready Status bit" edc:mask="0x1" edc:name="BORRDY" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="BORFS" edc:desc="" edc:mask="0x1" edc:name="BORFS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SBOREN" edc:desc="Software Brown Out Reset Enable bit" edc:mask="0x1" edc:name="SBOREN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="FVRCON" edc:desc="Voltage Reference Control Register 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0q000000" edc:name="FVRCON" edc:nzwidth="8" edc:por="0q000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CDAFVR" edc:desc="" edc:mask="0x3" edc:name="CDAFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Temperature Sensor Range Select" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Temperature Sensor Enable" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:desc="Fixed Voltage Reference Ready Flag" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:desc="Fixed Voltage Reference Enable" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR0" edc:desc="" edc:mask="0x1" edc:name="CDAFVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR1" edc:desc="" edc:mask="0x1" edc:name="CDAFVR1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nn-n--" edc:cname="DACCON0" edc:desc="Voltage Reference Control Register 0" edc:impl="0xb4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00-0--" edc:name="DACCON0" edc:nzwidth="8" edc:por="0-00-0--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="DAC1 Positive Source Select bit" edc:mask="0x1" edc:name="DACPSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE2" edc:desc="DAC1 Voltage Output 2  Enable bit" edc:mask="0x1" edc:name="DACOE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="DAC1 Voltage Output 1  Enable bit" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="DAC module enable" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
